Nedu41/SuDepoSis_v2/esp8266_slave/src/main.cpp
// ============ HTML (LittleFS'ten streamFile ile gonderilir) ============
// HTML artik RAM'de String olarak kurulmuyor; LittleFS'teki /index.html
// dosyasindan streamFile() ile dogrudan istemciye gonderilir.
// Dinamik degerler JS tarafinda /olc, /durum, /ayarlar API'lerinden cekilir.
// LittleFS'e yuklemek icin: pio run -t uploadfs
void handleRoot() {
  File f = LittleFS.open("/index.html", "r");
  if (f) {
    // FIX: tarayici bu sayfayi/JS'i cache'leyip guncellemeleri gostermeyebiliyordu
    // (uploadfs ile yeni ozellik eklense bile eski surum gorunuyordu).
    server.sendHeader("Cache-Control", "no-cache, no-store, must-revalidate");
    server.streamFile(f, "text/html");
    f.close();
  } else {
    server.send(404, "text/plain", "index.html yok! pio run -t uploadfs");
  }
}


// ============ SSE PUSH ============
void ssePush() {
  if (!sseAktif) return;
  if (!sseClient.connected()) { sseAktif = false; return; }
  String data = "data: " + durumJson() + "\n\n";
  sseClient.print(data);
}

void handleSSE() {
  if (sseAktif) { sseClient.stop(); sseAktif = false; }
  sseClient = server.client();
  sseClient.setNoDelay(true);
  sseClient.print(
    "HTTP/1.1 200 OK\r\n"
    "Content-Type: text/event-stream\r\n"
    "Cache-Control: no-cache\r\n"
    "Connection: keep-alive\r\n"
    "Access-Control-Allow-Origin: *\r\n"
    "\r\n"
  );
  sseAktif = true;
  ssePush();  // ilk veriyi hemen gönder
}

// ============ API ROTALARI ============
void handleRestart() {
  server.send(200, "application/json", "{\"basarili\":true,\"mesaj\":\"Yeniden baslatiliyor\"}");
  delay(100);
  ESP.restart();
}
void handleMeasure() { olcumYap(); ssePush(); server.send(200, "application/json", durumJson()); }
void handleStatus() { moistureOku(); if (ayar.moistureAutomatic) applyMoistureControl(); server.send(200, "application/json", durumJson()); }
void handleTime() {
  String json = "{\"zaman\":\"" + simdikiZamanStr() + "\",\"tarihISO\":\"" + simdikiTarihISO() + "\"}";
  server.send(200, "application/json", json);
}
void handleSetTime() {
  String m = "Hata!"; bool b = false;
  if (server.hasArg("zaman")) {
    String z = server.arg("zaman");
    if (z.length() >= 16) {
      int y = z.substring(0,4).toInt(), a = z.substring(5,7).toInt(), g = z.substring(8,10).toInt(), s = z.substring(11,13).toInt(), d = z.substring(14,16).toInt(), sn = z.length()>=19?z.substring(17,19).toInt():0;
      if (rtcHazir) { rtc.adjust(DateTime(y,a,g,s,d,sn)); m = "Zaman ayarlandi"; b = true; } else m = "RTC yok";
    } else m = "Format!";
  }
  server.send(200, "application/json", "{\"mesaj\":\"" + m + "\",\"basarili\":" + String(b?"true":"false") + "}");
}
void handleGetSettings() {
  String j = "{";
  j += "\"bosMesafe\":" + String(ayar.bosMesafe,1) + ",\"doluMesafe\":" + String(ayar.doluMesafe,1) + ",\"kapasite\":" + String(ayar.depoKapasiteLitre,0) + ",\"alarmYuzde\":" + String(ayar.alarmSeviyeYuzde,0) + ",\"geceBaslangic\":" + String(ayar.geceBaslangicSaat) + ",\"geceBitis\":" + String(ayar.geceBitisSaat) + ",\"minDolumLitre\":" + String(ayar.minDolumLitre,0) + ",\"kacakEsikDakika\":" + String(ayar.kacakEsikDakika) + ",\"depoYatay\":" + String(ayar.depoYatay) + ",\"moistureAutomatic\":" + String(ayar.moistureAutomatic ? "true" : "false") + ",\"moistureThresholdLow\":" + String(ayar.moistureThresholdLow) + ",\"moistureThresholdHigh\":" + String(ayar.moistureThresholdHigh) + ",\"triggerGunduz\":" + String(ayar.alarmTriggerGunduz) + ",\"triggerGece\":" + String(ayar.alarmTriggerGece) + ",\"alarmMod\":" + String(ayar.alarmMod) + ",\"alarmMaskSesli\":" + String(ayar.alarmMaskSesli) + ",\"alarmMaskSessiz\":" + String(ayar.alarmMaskSessiz) + ",\"alarmMaskOnayli\":" + String(ayar.alarmMaskOnayli) + ",\"alarmOutputSesli\":" + String(ayar.alarmOutputSesli) + ",\"alarmOutputSessiz\":" + String(ayar.alarmOutputSessiz) + ",\"pirOnaySaniye\":" + String(ayar.pirOnaySaniye) + "}";
  server.send(200, "application/json", j);
}
void handleSaveSettings() {
  if (server.hasArg("bosMesafe")) ayar.bosMesafe = server.arg("bosMesafe").toFloat();
  if (server.hasArg("doluMesafe")) ayar.doluMesafe = server.arg("doluMesafe").toFloat();
  if (server.hasArg("kapasite")) ayar.depoKapasiteLitre = server.arg("kapasite").toFloat();
  if (server.hasArg("alarmYuzde")) ayar.alarmSeviyeYuzde = server.arg("alarmYuzde").toFloat();
  if (server.hasArg("geceBaslangic")) ayar.geceBaslangicSaat = server.arg("geceBaslangic").toInt();
  if (server.hasArg("geceBitis")) ayar.geceBitisSaat = server.arg("geceBitis").toInt();
  if (server.hasArg("minDolumLitre")) ayar.minDolumLitre = server.arg("minDolumLitre").toFloat();
  if (server.hasArg("kacakEsikDakika")) ayar.kacakEsikDakika = server.arg("kacakEsikDakika").toInt();
  if (server.hasArg("depoYatay")) ayar.depoYatay = server.arg("depoYatay").toInt();
  if (server.hasArg("moistureAutomatic")) ayar.moistureAutomatic = server.arg("moistureAutomatic").toInt() ? 1 : 0;
  if (server.hasArg("moistureThresholdLow")) {
    int v = server.arg("moistureThresholdLow").toInt(); if (v < 0) v = 0; if (v > 100) v = 100; ayar.moistureThresholdLow = v;
  }
  if (server.hasArg("moistureThresholdHigh")) {
    int v = server.arg("moistureThresholdHigh").toInt(); if (v < 0) v = 0; if (v > 100) v = 100; ayar.moistureThresholdHigh = v;
  }
  if (server.hasArg("triggerGunduz")) ayar.alarmTriggerGunduz = server.arg("triggerGunduz").toInt();
  if (server.hasArg("triggerGece")) ayar.alarmTriggerGece = server.arg("triggerGece").toInt();
  if (server.hasArg("alarmMod")) {
    int m = server.arg("alarmMod").toInt();
    if (m >= 1 && m <= 3) { ayar.alarmMod = m; alarmOnayBekliyor = false; alarmOnaylandi = false; alarmOnaySadeceLamba = false; alarmSusturuldu = false; }
  }
  if (server.hasArg("alarmMaskSesli")) ayar.alarmMaskSesli = server.arg("alarmMaskSesli").toInt();
  if (server.hasArg("alarmMaskSessiz")) ayar.alarmMaskSessiz = server.arg("alarmMaskSessiz").toInt();
  if (server.hasArg("alarmMaskOnayli")) ayar.alarmMaskOnayli = server.arg("alarmMaskOnayli").toInt();
  if (server.hasArg("alarmOutputSesli")) ayar.alarmOutputSesli = server.arg("alarmOutputSesli").toInt();
  if (server.hasArg("alarmOutputSessiz")) ayar.alarmOutputSessiz = server.arg("alarmOutputSessiz").toInt();
  if (server.hasArg("pirOnaySaniye")) {
    int v = server.arg("pirOnaySaniye").toInt(); if (v < 0) v = 0; if (v > 30) v = 30; ayar.pirOnaySaniye = v;
  }
  ayarlariKaydet(); olcumYap();
  server.send(200, "application/json", "{\"mesaj\":\"Ayarlar kaydedildi\",\"basarili\":true}");
}

