Nedu41/SuDepoSis_v2/esp8266_slave/src/main.cpp
// ============ LOOP ============
void loop() {
  ArduinoOTA.handle(); server.handleClient();

  // AP her zaman acik olmali (STA baglantisindan bagimsiz). Nadiren heap
  // parcalanmasi/RF sorunu ile AP dusebiliyor - periyodik kontrol edip
  // gerekirse yeniden baslatiyoruz.
  static unsigned long sonApKontrolMs = 0;
  unsigned long simdiMs = millis();
  if (simdiMs - sonApKontrolMs >= 30000UL) {
    sonApKontrolMs = simdiMs;
    if (!(WiFi.getMode() & WIFI_AP)) {
      DEBUG_PRINTLN("[WIFI] AP kapaliydi, yeniden baslatiliyor");
      WiFi.mode(WIFI_AP_STA);
      WiFi.softAP(WIFI_AP_SSID, WIFI_AP_PASSWORD, WIFI_AP_CHANNEL, WIFI_AP_HIDDEN);
    }
  }

  // RTC bagliliğini periyodik yeniden dene. Sadece setup()'ta bir kez
  // denenirse, boot anindaki gecici bir I2C hazirsizlik/gecikme sorunu
  // rtcHazir'i kalici olarak false'ta biraktiriyordu - sonraki reboot'a
  // kadar hicbir zaman duzelmiyordu ("bazen calisiyor bazen calismiyor"
  // davranisinin sebebi buydu). Simdi 30sn'de bir tekrar denenir.
  static unsigned long sonRtcDenemeMs = 0;
  if (!rtcHazir && simdiMs - sonRtcDenemeMs >= 30000UL) {
    sonRtcDenemeMs = simdiMs;
    Wire.begin(RTC_SDA, RTC_SCL);
    if (rtc.begin()) {
      rtcHazir = true;
      DEBUG_PRINTLN("[RTC] Yeniden baglanildi");
    }
  }

  // FIX: WiFi koparsa mDNS'i yeniden baslat (STA modu icin)
  if (strlen(wifiAyar.ssid) > 0) {
    if (WiFi.status() == WL_CONNECTED && !mdnsAktif) {
      String host = mdnsHostname();
      if (MDNS.begin(host.c_str())) {
        MDNS.addService("http", "tcp", 80);
        mdnsAktif = true;
        DEBUG_PRINTF("[mDNS] Yeniden baslatildi: %s.local\n", host.c_str());
      }
    } else if (WiFi.status() != WL_CONNECTED) {
      mdnsAktif = false;
    }
  }

  MDNS.update();
  nanoPoll();
  server.handleClient();  // FIX: Bloklayıcı nanoPoll sonrası web isteklerini işle
  rs485KomutDinle();
  server.handleClient();  // FIX: RS485 dinleme sonrası web isteklerini işle
  // ALARM KONTROLÜ - nanoMesgul kontrolü blink'i önler (komut beklerken yeni gönderme)
  if (!nanoMesgul) {
    // PANIK MODU - toggle, sürekli komut gönderme (her seyin onunde, mod/susturma etkilemez)
    if (panicRoleAktif) {
      alarmTetikleyenMask = 0; // panikte sensor tetikleyicisi yok, elle acildi
      alarmCikisLambaIstenen = true; // panikte her zaman hem siren hem lamba
      if (!roleFizikselDurum) nanoRoleKontrol(true);
    } else if (!ayar.alarmRoleAktif) {
      // Alarm sistemi kapali: hicbir tetikleyici sirene/roleye yansimamali
      alarmSusturuldu = false; alarmOnayBekliyor = false; alarmOnaylandi = false; alarmOnaySadeceLamba = false;
      alarmTetikleyenMask = 0;
      alarmCikisLambaIstenen = false;
      if (roleFizikselDurum) nanoRoleKontrol(false);
    } else {
      // Zaman bazli (gunduz/gece) VE secili modun kendi senaryosu (hangi sensorler
      // bu modu tetikler) birlikte degerlendirilir.
      uint8_t zamanMask = geceModuMu() ? ayar.alarmTriggerGece : ayar.alarmTriggerGunduz;
      uint8_t modMask;
      switch (ayar.alarmMod) {
        case ALARM_MOD_SESSIZ: modMask = ayar.alarmMaskSessiz; break;
        case ALARM_MOD_ONAYLI: modMask = ayar.alarmMaskOnayli; break;
        default:                modMask = ayar.alarmMaskSesli; break;
      }
      uint8_t mask = zamanMask & modMask;
      bool triggerActive = false;
      uint8_t tetikleyenMask = 0;
      if ((mask & ALARM_TRIGGER_KAPI1) && kapi1Acik) { triggerActive = true; tetikleyenMask |= ALARM_TRIGGER_KAPI1; }
      if ((mask & ALARM_TRIGGER_KAPI2) && kapi2Acik) { triggerActive = true; tetikleyenMask |= ALARM_TRIGGER_KAPI2; }
      if ((mask & ALARM_TRIGGER_PIR) && pirTetikleyici) { triggerActive = true; tetikleyenMask |= ALARM_TRIGGER_PIR; }
      if ((mask & ALARM_TRIGGER_SU_SEVIYE) && alarmAktif) { triggerActive = true; tetikleyenMask |= ALARM_TRIGGER_SU_SEVIYE; }
      if ((mask & ALARM_TRIGGER_KACAK) && kacakAlarmi) { triggerActive = true; tetikleyenMask |= ALARM_TRIGGER_KACAK; }
      if ((mask & ALARM_TRIGGER_SENSOR) && sensorHatasi) { triggerActive = true; tetikleyenMask |= ALARM_TRIGGER_SENSOR; }
      alarmTetikleyenMask = tetikleyenMask;

      if (!triggerActive) {
        // Tetikleyici temizlendi - susturma/onay durumlari sifirlanir (bir sonraki
        // tetiklenmede modun varsayilan davranisi yeniden gecerli olsun)
        alarmSusturuldu = false; alarmOnayBekliyor = false; alarmOnaylandi = false; alarmOnaySadeceLamba = false;
        alarmCikisLambaIstenen = false;
        if (roleFizikselDurum) nanoRoleKontrol(false);
      } else {
        bool sirenIstenen;
        // Sesli/Sessiz modda hangi cikislarin (siren/lamba) aktif olacagi artik
        // kullanicinin Alarm Ayarlari'ndaki "Mod Senaryolari" cikis secimlerinden
        // (ayar.alarmOutputSesli/Sessiz) geliyor - eskiden Sessiz mod icin siren
        // VE lamba sabit/hardcoded kapaliydi, "sadece bildirim" hic gorunmuyordu.
        if (ayar.alarmMod == ALARM_MOD_SESSIZ) {
          sirenIstenen = (ayar.alarmOutputSessiz & ALARM_OUTPUT_SIREN) && !alarmSusturuldu;
          alarmCikisLambaIstenen = (ayar.alarmOutputSessiz & ALARM_OUTPUT_LAMBA) != 0;
        } else if (ayar.alarmMod == ALARM_MOD_ONAYLI) {
          if (alarmOnaySadeceLamba) {
            sirenIstenen = false; alarmCikisLambaIstenen = true; // sadece lamba flaşörü - siren/role calismaz
          } else if (!alarmOnaylandi) {
            alarmOnayBekliyor = true; sirenIstenen = false; alarmCikisLambaIstenen = false;
          } else {
            sirenIstenen = !alarmSusturuldu; alarmCikisLambaIstenen = sirenIstenen;
          }
        } else {
          // Sesli mod
          sirenIstenen = (ayar.alarmOutputSesli & ALARM_OUTPUT_SIREN) && !alarmSusturuldu;
          alarmCikisLambaIstenen = (ayar.alarmOutputSesli & ALARM_OUTPUT_LAMBA) != 0;
        }
        if (sirenIstenen && !roleFizikselDurum) nanoRoleKontrol(true);
        else if (!sirenIstenen && roleFizikselDurum) nanoRoleKontrol(false);
      }
    }
  }
  // ALARM LAMBA FLASI - role fiziksel olarak tetikliyken (panik dahil) lamba
  // yanip soner; role kapaninca lamba tetiklenmeden onceki durumuna doner.
  // Kendi !nanoMesgul kontrolünü ayrı yapar ki yukarıdaki role komutu
  // kuyruğu meşgul ettiğinde bu döngüde beklesin, bir sonrakinde devam etsin.
  // Lamba, artik yukarida hesaplanan alarmCikisLambaIstenen'e gore yanip
  // sonuyor (mod cikis ayarindan geliyor) - roleFizikselDurum'a bagimli
  // DEGIL, boylece "siren acik, lamba kapali" gibi kombinasyonlar da
  // dogru calisir (eskiden lamba sadece siren fiziksel olarak tetiklenince
  // yanip soner, Sessiz modda hicbir zaman yanmazdi).
  if (alarmCikisLambaIstenen) {
    if (!lambaFlashAktif) {
      lambaFlashAktif = true;
      lambaFlashOncekiManuel = lambaAcik;
      lambaFlashSonDegisimMs = millis();
    } else if (!nanoMesgul && millis() - lambaFlashSonDegisimMs >= LAMBA_FLASH_ARALIK_MS) {
      lambaFlashSonDegisimMs = millis();
      nanoLambaKontrol(!lambaAcik);
    }
  } else if (lambaFlashAktif) {
    lambaFlashAktif = false;
    if (!nanoMesgul) nanoLambaKontrol(lambaFlashOncekiManuel);
  }
  server.handleClient();  // FIX: Röle kontrol sonrası web isteklerini işle
  unsigned long s = millis();
  uint16_t a = geceModuMu() ? ayar.olcumAraligiGece : ayar.olcumAraligiGunduz;
  if (s - sonOtomatikOlcumMs >= (unsigned long)a * 1000UL) { olcumYap(); sonOtomatikOlcumMs = s; ssePush(); server.handleClient(); }
  // SSE periyodik durum guncelleme (1500ms) - sensör olcumu yapmadan sadece durum iter
  static unsigned long sseGonderMs = 0;
  if (s - sseGonderMs >= 1500UL) { sseGonderMs = s; moistureOku(); ssePush(); }
  // Periyodik RS485 gonderimi (1000ms) - ESP32 poll'u kacirsa bile veri akisi devam eder
  static unsigned long sonMasterGonderMs = 0;
  if (s - sonMasterGonderMs >= RS485_SEND_INTERVAL) {
    sonMasterGonderMs = s;
    masterGonder();
    server.handleClient();  // FIX: RS485 gönderim sonrası web isteklerini işle
  }
}